n = int(input('Введите кол-во посетителей: ')) #кол-во человек
years = list() #список для возрастов посетителей
cost = 0 #общая стоимость всех билетов

#записываем возраста посетителей в список:
for i in range(n):
    years.append(int(input()))

#цикл для подсчета стоимости билетов в зависимости от возраста:
for j in years:
    if j >= 18 and j < 25:
        cost += 990
    elif  j >= 25:
        cost += 1350

#считаем скидку, если посетителей больше 3х:
if n > 3:
    cost = 0.9*cost

#выводим конечную стоимость:
print('С вас ', cost, ' рублей')
